---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LossFactor
source: html/23224470-b97a-7acc-8dbe-667086568b1c.htm
---
# Autodesk.Revit.DB.Lighting.LossFactor

This class is the base class for calculating lighting loss factor.

## Syntax (C#)
```csharp
public class LossFactor : IDisposable
```